Revit 2026 API

# RailingTypePrimaryHandrailHeight Property

---

The height of the primary handrail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PrimaryHandrailHeight { get; }
```
```vb
Public ReadOnly Property PrimaryHandrailHeight As Double
	Get
```
```cpp
public:
property double PrimaryHandrailHeight {
	double get ();
}
```
```fsharp
member PrimaryHandrailHeight : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The rail has no primary hand rail. |

#### Reference

RailingType Class

Autodesk.Revit.DB.Architecture Namespace